{
  "assets": [
    {
      "id": "asset_20251029135935_0",
      "filename": "Outreach Templates.txt",
      "category": "guidelines",
      "path": "brand_voice_assets/guidelines/Outreach Templates.txt",
      "size": 19741,
      "text_preview": "﻿Outreach Templates\n1st message\nHey NAME, how’s it going?\nI have been given your name as we are looking for videographers in your area.\nAre you open to taking on more paid video work?\n\n\n2nd message (no first 2 lines) / 1st message for those who invented to skool before\nHey NAME, how’s it going?\nAre you open to picking up more paid video work?\n\n\nWe have clients across the UK NAME, with multiple shoots coming up on a regular basis. Thought you might want to take a look.\nWe’ve already had multiple ",
      "full_text": "﻿Outreach Templates\n1st message\nHey NAME, how’s it going?\nI have been given your name as we are looking for videographers in your area.\nAre you open to taking on more paid video work?\n\n\n2nd message (no first 2 lines) / 1st message for those who invented to skool before\nHey NAME, how’s it going?\nAre you open to picking up more paid video work?\n\n\nWe have clients across the UK NAME, with multiple shoots coming up on a regular basis. Thought you might want to take a look.\nWe’ve already had multiple projects booked in your area. \n\n\nTo receive enquiries from clients, join for free to Orla3.com, the first national directory where clients can find and book videographers directly. Just upload your portfolio, connect your bank account, set your exact location, and you’re ready.\nWe only take a 10% success fee once the job is delivered and you have been paid.\n\n\nClients pay upfront and the money is released once the deliverables are downloaded. No chasing, no waiting for payments.\n\n\nWould you be open to a quick 30-minute Google Meet?\nWe can help you set up your profile and show you how other videographers are already picking up jobs through the platform.\n\n\n\n\nWhen they ask who the referral was\nI’ll check who it was, NAME, but it will be hard to track. It was another videographer. We were talking about Orla3.com bringing more videographers on board soon and they mentioned your name.\nI’ve had quite a few referrals lately and usually just note down the name of the person to contact, but not who referred them. That’s on me! I’ll start keeping track of both going forward.\n\n\n\n\nIf ignored or the answer is NO\nNo Problem NAME. We have one of the biggest client bases in AREA, with few videographers, and one of them has already taken NUMBER bookings since launch, which was 14 days ago.\n\n\n—--------------------------------------------------------------------------------------------------------------------------\n\n\nNo problem, NAME. We actually have very few videographers in your area right now. As you can see from the picture, one of them in AREA has already taken NUMBER bookings since launch, which was NUMBER days ago. I know that’s a bit further out, but in your area we already have a strong client base waiting for videographers.\nIf happy to hear more about Orla3, let me know when you would like to have a quick chat.\n\n\nFinal message\nThat's you booked in! Please accept Costantino Marcello’s connection request. He will be the person hosting the meeting with you. Do you mind sharing your email with me to send you an invitation link?\nBe in touch with any changes required or feedback 🙂\n\n\n\n\n\n\n\n\nFor who is signed up but no location/videos\nHi NAME, we are going through some of the profiles and noticed your profile visibility is limited on Orla3.com. To start getting discovered in full and booked, please:\n- Upload multiple videos from different projects and industries. This increases your reach to clients.\n- Connect your bank account so Stripe can release payments for completed jobs (Stripe will request a £0 transaction fee to verify the account)\n- Set your location (city/town) in your profile section (Profile → Edit Profile → Save Changes). Without this, your visibility is reduced.\n- Select the correct specialties. These can also be changed in your profile section.\n\nCompleting these steps will make you fully discoverable and ready to receive bookings.\n\n\n\n\nFor Clients 1\nHey NAME, how are you?\nI was chatting with a few business owners recently, and most said finding videographers can be a bit of a headache. Has that been true for you?\n\n\nFor Clients 2\nHey NAME, how are you?\nWe’ve just launched Orla3.com, the goal was to make booking freelance videographers simple, quickly and safely. And it's free to sign up!\nThe payment is upfront, the money is held securely in escrow, and you only release it once the work is delivered.\n\n\nIf you’re planning any video campaigns soon, this could save you a lot of chasing around.\nWould it help if I showed you quickly how it works in a 20min google meet?\n\n\n\n\n\n\nHi NAME,\nAttached is the motion graphic of the Orla3 logo.\nFor best results, we recommend using a 9:16 format to fit Instagram Reels.\nOnce you have added the graphic, please make sure the video is downloadable so we can post it.\nAlso, let us know which Instagram username you would like us to tag for the collaboration.\nYou can submit as many videos as you like. They do not need to be showreels. Any project you are proud of works, even one or two clips a day. We will make sure they get posted. The more you share, the more visibility you get. That means more chances to get work.\nBest,\n\n\nIntro:\nHey NAME, how's everything going?\nWe’ve been quiet but working a lot behind the scenes. Orla3's launch date is confirmed, and the giveaway terms have changed to benefit you.\nWe’ll boost your videos on social with your personal booking link once we go live.\nWatch this short 3min video and check the updated giveaway terms.\nhttps://www.youtube.com/watch?v=vt37dku-LWA\n\n\nLanding Page & Platform Demo:\nWe've been signing new clients to the waitlist and gaining strong traction.\nTo help that grow, we built a landing page with a demo made for both clients and videographers. More credibility. More work for you.\nThe platform design’s improved.\nHave a look the landing page (still work in progress) and the 5min demo preview here before we start sponsoring it: https://orla3.com\nIf you were a client, would you join the waitlist?\nLet me know your feedback 🙏🏼\nIntro 2\nHey mate, how are you doing?\nI have been giving 1-to-1 support to the Orla3 community videographers for free, have a look at the feedback below and let me know if you would like one 🙂\nhttps://www.skool.com/orla3/help-me-with-your-feedback\n\n\n\n\n\n\nOutreach for Calls (Costa)\nHey NAME, I am Costa, nice to meet you, how are you?\nI appreciate you are busy so I will keep this short.\nI work on the business, sales and marketing aspect of Orla3.\nWe are working on our marketing campaign.\nI spoke to most Videographers in the community and you are one of the few left.\nIt would be great to know what you specialise in, to tailor our campaign and get the best results. Are you free for a 30min Google meet at some point next week?\n\n\nFeedback (Costa)\n* Hey NAME, how are you?\n* Thank you for taking my call.\n* I would really appreciate it if you could help me with your feedback about the call in the Skool post (link below). Your input helps us spot common themes and we'll then create a short video you can watch any time.\n* Let me know if you need any more help. I am here anytime.\n* Thank you in advance 🙏🏼\n* https://www.skool.com/orla3/help-me-with-your-feedback\n\n\nOutreach for Calls 2nd attempt (Steven)\nHey NAME, how are you?\nIf you take 20 or more bookings per month consistently you can ignore this message.\nWe are about a month away from launching Orla3’s marketing campaign and you are one of the last ones left to get some info from.\nOur community videographers on Costa’s recent calls asked him about approach, sales and growth.\nWhat started as a marketing briefing for our marketing campaign became a one-to-one coaching session. He gave free value such as clear, practical advice, with some getting gigs, retainers and nearly doubling their price!\nTo book your own call, accept Costa’s connection on LinkedIn (link below) and message him by the 6th June.\nhttps://www.linkedin.com/in/costantino-marcello/\nHere is what some of them said after their call.\n\n\n(Feedback Pics)\n\n\nSteven Previous Calls (Costa)\nHi NAME, how are you?\nIf you take 20 or more bookings per month you can ignore this message.\nWe are about to launch the Orla3’s marketing campaign and you are one of the last ones left to get some info from.\nThe Orla3 community videographers on recent calls asked me about approach, sales and growth.\nWhat started as a marketing briefing for Orla3’s campaign became a one-to-one coaching session.\nI gave free value such as clear, practical advice, with some getting gigs, retainers and nearly doubling their price!\nIf you think this could help you, to book your own call, let me know by the 6th June\nHere is what people said after their call.\n\n\n(Feedback Pics)\n\n\n\n\nIgnored\nI appreciate you're busy . In case you've missed it, we are launching Orla3 soon. As a thank you for testing and shaping our platform, we are giving away free equipment and merchandise worth £2000.\nWe are about to shut the doors, if you're not in the community yet, here is the link:\nhttps://www.skool.com/orla3\nAbove all, we lack Videographers in . This means you'll have plenty of work from the next couple of  months.\n\n\n\n\nhttps://www.linkedin.com/feed/update/urn:li:activity:7303426483455180801\n\n\n(Add photo of poll if not sent before)\n\n\nEngagement Message\nThat’s perfect !\nI appreciate you are busy . I will keep it short. My team and I have put together a community purely with likeminded and  talented videographers (195 for now) with different skillsets, from all over the UK.\n \nWe are launching “Orla3” soon, our merit based, peer to peer platform “for videographers, made by videographers”, to solve the problems most of us have with irregular work, getting paid late and getting paid partially. Clients pay upfront (held safely in escrow) and Orla3 releases funds to the videographer once successful delivery (there is much more).\nAs a thank you for testing and shaping our platform, we are giving away free equipment and merchandise worth £2000.\nWe are about to shut the doors, here is the link to join the community:\nhttps://www.skool.com/orla3\nAbove all, we lack Videographers in your area. This means you'll have plenty of work in a couple of months.\nLet me know if you would like to know more about it.\n\n\n(add photo of poll)\n\n\nOrla3 Explained\nHey , to give you a clear picture of what we have been working on, have a wee look at this when you have a minute. I think you would love it!\nLet me know if you would like to be added to the shortlist.\nhttps://www.linkedin.com/feed/update/urn:li:activity:7303426483455180801\n\n\n\n\n\n\n\n\nOrla3 Explained & Closure\nI am going to give you a bit more context to understand better.\n\n\nWe have built a community where all testing communications will be and where you get free videography and marketing courses to increase your client base, connect with likeminded professionals, and exchange advice. All at no cost.\n\n\nVery soon we will release Orla3, our merit based, videography platform that directly connects you with clients.\n\n\nHow it works:\n-Direct Matches: Clients specify location, date, project type, and budget. Our AI then refines the results, showcasing all the relevant videographers based on the client’s description.\n-Organic visibility: No fees or subscriptions. Reviews determine your ranking (more & good reviews = better visibility)\n-In full & on time payments: Clients pay upfront (held in escrow) and release funds once successful delivery (preview watermarked protected)\n\n\nWhy join our community?\n-Early access: Test and shape Orla3 with your feedback.\n-Secure your profile: Build reviews before the public launch.\n-Stay ahead: Gain top visibility as client demand grows with our May marketing campaign.\n\n\nWe would love to have you on board while testing the Beta version of Orla3.\n\n\nIf interested, let me add you to the shortlist.\n\n\nCurrent members feedback courses\nHey , how are you? We got a lot of positive feedback from the courses and I wanted to ask you if you have any yourself? Are there any of the subjects that you would like more in depth information on?\n\n\nImportant Areas\nHey , just trying to get this on top of your inbox and catch your attention.\nWe are launching Orla3 very soon! Above all, we lack sellers in Scotland. This means you'll have plenty of work from the next couple of months after testing!\n\n\nClosing at confirmation from videographer\nAmazing ! All communications will be through the community as said previously.\nHere is the link:\nhttps://www.skool.com/orla3\nI’ve shared your details with my team to shortlist you. You will receive an email at the address on your contact info. Let me know if you don't get it.\nIn the meantime, a follow for the Orla3 page would be nice.\nhttps://www.linkedin.com/company/orla3/\n\n\nSee you inside!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRaw Messages\nImagine a community where there are free courses on videography and on marketing to help you increase your client base. Also with likeminded people to relate to and to get or give help/advice when needed. All totally free!\nThat’s what it is!\n\n\nnow, imagine a videography focused platform that connects clients directly to videographers, that would work like this:\n-Clients choose location, date & time, project type and budget, and relevant videographers will appear.\n-No fees or subscriptions: Fully organic visibility (forget ads or paid to feature). Those with the most and best reviews appear first in client searches.\n-Guaranteed payments: Full payment paid in advance by the client (held in escrow) and delivered promptly to the videographer on completion, once the client downloads your work (preview protected by watermarks).\n\n\nBeing all about meritocracy and not who has the most money to sponsor and as part of this community, you can help us build and improve this project!\n\n\nThis is what we are building: Orla3\n\n\nWe believe clients deserve the best out of us, while we, videographers, are protected and assured to receive full payment and on time,  if we deliver what promised, as we deserve it!\n\n\nFor the beta version we are handpicking our videographers and I believe that you could be a really good candidate.\n\n\nAs part of our community, you will have the benefit to access ORLA3 as an early bird to:\n-Test and give feedback about the platform as we want to make it the way videographers want it.\n-Secure your profile ahead of the public launch by building reviews immediately utilising the platform with existing clients.\n-Establish top visibility and assurance that you’re positioned ahead of the curve as clients demand rises, when our clients targeted marketing campaign begins in May.\n\n\nIf you would like to be part of it, I will add your name to the shortlist.\n\n\n\n\n\n\nAfter the test phase, there will be a 10% transaction fee that is applied, when acquiring completely new clients, to both sides of the transaction and is only taken when you earn (at completion of work), so we aim to help videographers maximise their earnings.\nOne way to achieve this is when a client's budget exceeds your standard fee, we may automatically boost your fee by 20%, with your consent, to make sure you have a better compensation, never less. For example, if your fee is £500 and the client's budget is £1,000, your fee would be increased to £600. This benefits both you and the client, as you receive a higher fee for your work, while the client still receives a reasonable price, below their initial budget.\n\n\n\n\n\n\nReal estate script\nHi [Client], I would love to get some help from you.\nMy name is [Name]  and I have nearly [Yeras] years experience as a professional videographer.\nI am aiming to add real estate work to my portfolio and I would love to offer you a free promotional video or reel for one of your properties listed over 3 months.\n\n\nThis video will also help you to:\n* Attract more viewers\n* Highlight key features with professional footage\n* Boost online interest of your social platforms\n* Increase traffic on your website which drives better visibility on Google\n\n\n\n\nWhich listing could benefit most from a fresh video? What day this week/next week would be best to meet at your agency and discuss the details?\n\n\n[Name]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFor facebook groups\n\n\nfrom seller's perspective:\nHey guys, just wanted to share something which could be interesting to many of you.\nI have come across this platform, and had a chat with one of the founders who explained the concept. Essentially it is a directory for clients to find videographers based on various selection criteria like date, location, price and type of shoot. You can sign up for free and once your profile is completed, it is visible to clients who can then book you on the platform. Clients pay upfront and payment is released automatically once the deliverables are downloaded.\nCheck it out: orla3.com \n\n\nReviewed\nHey guys, thought I’d share my experience with Orla3.com, it’s like a national directory for clients to find Videographers. Mind blowing, right?\nOne of the founders approached me on LinkedIn a couple of weeks ago.\nAfter the call with him, I signed up and already had a booking come through.\nWhat I like most is that clients pay upfront, the money is held safely in escrow, and I get paid as soon as I deliver. I don’t have to chase invoices and wait 30-60 days.\n\n\nI’ve also started bringing my own clients onto it. They take a 10% fee, but honestly I’d rather take £900 now than wait a month or two hoping for £1,000. For me the peace of mind and guaranteed payment are worth it.\nSo now all my bookings are in one place, protects my work with watermarking, and helps me build reviews that boost my visibility with new clients. \n\n\nIt’s free to set up a profile, and clients can search by location, budget, and type of shoot.\n\n\nFor me it’s been a smooth way to manage projects and focus on what I love.\nWorth checking out: orla3.com\n\n\n\n\n\n\nfrom buyer's perspective:\nHey guys, just wanted to share something which could be interesting to many of you.\nI have come across this platform, and had a chat with one of the founders who explained the concept. Essentially it is a directory for clients to find videographers based on various selection criteria like date, location, price and type of shoot. You can browse from many videographers, see their packages and even message them. Once chosen you can book directly on the platform with great payment security and right of refusal if the outcome is not as expected.\nCheck it out: orla3.com\n\n\nReviewed:\nHey everyone, just thought I’d share Orla3.com because I’ve been using it myself.\nI signed up a couple of weeks ago after one of the founders approached me on LinkedIn.\nSoon after I needed a videographer and it honestly saved me a lot of hassle.\nI was able to browse portfolios, see clear packages, and quickly shortlist the ones that fit my budget. I sent one brief out to 3 videographers at the same time and attached a document with all the details. Within a day I had replies to compare side by side. Mind blowing, right?\nThe ‘favourites’ tool made it easy to weigh up who offered the best value.\n\n\nThe best part was the payment. No more paying 50% upfront and then crossing your fingers they’ll show up or feeling stuck with whatever they deliver because you’ve already paid half.\nThe full amount is paid on booking and held safely in escrow. You will only release it once you’re happy with the work.\nI used it for a short campaign video and got the final edit exactly how I wanted. The payment was released instantly after I approved it.\n\n\nI’ve already lined up my next project there. It’s free to sign up, easy to manage, and way less stressful than the old way of chasing quotes and hoping for the best.\n\n\nDefinitely worth a look if you’ve got video projects coming up. Here is the link: orla3.com",
      "uploaded_at": "2025-10-29T13:59:35.719737",
      "source": "google_drive",
      "drive_file_id": "18vaKn1YIhXbLJYeTE4-SH1rv6nAq54Faba6hCRRsyVQ",
      "drive_target_id": "18vaKn1YIhXbLJYeTE4-SH1rv6nAq54Faba6hCRRsyVQ"
    }
  ],
  "last_updated": "2025-10-29T13:59:35.719754"
}